#include <stdio.h>

int main()
{
    int matrix[8][8] = {
        {  1,  2,  3,  4,  5,  6,  7,  8 },
        {  9, 10, 11, 12, 13, 14, 15, 16 },
        { 17, 18, 19, 20, 21, 22, 23, 24 },
        { 25, 26, 27, 28, 29, 30, 31, 32 },
        { 33, 34, 35, 36, 37, 38, 39, 40 },
        { 41, 42, 43, 44, 45, 46, 47, 48 },
        { 49, 50, 51, 52, 53, 54, 55, 56 },
        { 57, 58, 59, 60, 61, 62, 63, 64 }
    };


    /*printf("%d %d %d %d %d %d %d %d", matrix[0][0], matrix[1][1], matrix[2][2], matrix[3][3], matrix[4][4], matrix[5][5]
, matrix[6][6], matrix[7][7] );*/

    for (int m = 0; m < sizeof(matrix) / sizeof(matrix[0]); m++)
    {
        printf("%d ", matrix[m][m]);
    }


    // 실행결과
    // 1 10 19 28 37 46 55 64
    return 0;
}